Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.RemoveTemporaryGraphicsObjects Method
 Remove a list of temporary graphic objects from all views.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void RemoveTemporaryGraphicsObjects(
	IEnumerable GraphicObjectIDs
)
Public Sub RemoveTemporaryGraphicsObjects (
	GraphicObjectIDs As IEnumerable
)
Parameters
GraphicObjectIDs
Type: System.Collections.IEnumerable
The identifiers that was returned when the object was created.
See Also
Reference
GraphicsDrawer Class
Tekla.Structures.Model.UI Namespace